Repository: tralivali1234/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/MultilingualResources/Microsoft.VisualStudio.Threading.Analyzers.*.xlf
Languages: pt_br

# AwaitXInstead
source: Await {0} instead
pt_br: Em vez disso, espere o {0}

source: Use await instead
pt_br: Em vez disso, use a espera

# VSTHRD002_MessageFormat
source: Synchronously waiting on tasks or awaiters may cause deadlocks. Use await or JoinableTaskFactory.Run instead.
pt_br: Esperar de forma síncrona por tarefas ou awaiters pode causar deadlocks. Em vez disso, use await ou JoinableTaskFactory.Run.

# VSTHRD002_Title
source: Avoid problematic synchronous waits
pt_br: Evite esperas síncronas problemáticas

# VSTHRD010_Title
source: Invoke single-threaded types on Main thread
pt_br: Invoque os tipos single-threaded no thread principal

# VSTHRD100_MessageFormat
source: Avoid "async void" methods, because any exceptions not handled by the method will crash the process.
pt_br: Evite métodos "async void”, pois exceções que não são manipuladas pelo método causarão falha no processo.

# VSTHRD100_Title
source: Avoid async void methods
pt_br: Evite métodos async void

# VSTHRD101_MessageFormat
source: Avoid using async lambda for a void returning delegate type, because any exceptions not handled by the delegate will crash the process.
pt_br: Evite usar o lambda async void para um tipo de delegado que é retornado nulo, pois todas as exceções que não são manipuladas pelo delegado causarão falha no processo.

# VSTHRD101_Title
source: Avoid unsupported async delegates
pt_br: Evite delegados assíncronos sem suporte

# VSTHRD106_MessageFormat
source: AsyncEventHandler delegates should be invoked via the extension method "TplExtensions.InvokeAsync()" defined in Microsoft.VisualStudio.Threading assembly.
pt_br: Os delegados do AsyncEventHandler devem ser invocados por meio do método de extensão "TplExtensions.InvokeAsync()" definido no assembly Microsoft.VisualStudio.Threading.

# VSTHRD106_Title
source: Use InvokeAsync to raise async events
pt_br: Use InvokeAsync para acionar eventos assíncronos

# VSTHRD003_MessageFormat
source: Calling await on a Task when the task is initialized in another context can cause potential deadlocks. You can avoid this problem by ensuring the task is initialized within the same method or by using JoinableTask instead of Task.
pt_br: Chamar await em uma Task em JoinableTaskFactory.Run, quando a tarefa for inicializada fora do delegado pode causar deadlocks em potencial. Você pode evitar esse problema assegurando que a tarefa seja inicializada no delegado ou usando JoinableTask em vez de Task.

# VSTHRD003_Title
source: Avoid awaiting foreign Tasks
pt_br: Evite aguardar tarefas não unidas em contextos de junção

# VSTHRD011_MessageFormat
source: Lazy<Task<T>>.Value can deadlock. Use AsyncLazy<T> instead.
pt_br: Lazy<Task<T>>. O valor pode apresentar deadlock. Em vez disso, use AsyncLazy<T>.

# VSTHRD011_Title
source: Use AsyncLazy<T>
pt_br: Usar AsyncLazy<it id="1" pos="open"><T></it>

# VSTHRD103_MessageFormat
source: {0} synchronously blocks. Await {1} instead.
pt_br: O {0} é bloqueado de forma síncrona. Em vez disso, espere o {1}.

# VSTHRD103_MessageFormat_UseAwaitInstead
source: {0} synchronously blocks. Use await instead.
pt_br: O {0} é bloqueado de forma síncrona. Em vez disso, use await.

# VSTHRD103_Title
source: Call async methods when in an async method
pt_br: Chame métodos assíncronos quando estiver em um método assíncrono

# VSTHRD102_MessageFormat
source: Limit use of synchronously blocking method calls such as JoinableTaskFactory.Run or Task.Result to public entrypoint members where you must be synchronous. Using it for internal members can needlessly add synchronous frames between asynchronous frames, leading to threadpool exhaustion.
pt_br: Limite o uso bloqueando sincronicamente chamadas de método como JoinableTaskFactory.Run ou Task.Result para membros de ponto de entrada no qual você deve ser síncrono. Usar isso para membros internos pode adicionar sem necessidade estruturas síncronas entre estruturas assíncronas, levando à exaustão de pool de threads.

# VSTHRD102_Title
source: Implement internal logic asynchronously
pt_br: Implementar a lógica interna de forma assíncrona

# VSTHRD200_CodeFix_Title
source: Rename to {0}
pt_br: Renomear para {0}

# VSTHRD200_Title
source: Use "Async" suffix for async methods
pt_br: Use o sufixo "Async" para métodos assíncronos

# VSTHRD100_CodeFix_Title
source: Change return type to Task
pt_br: Alterar o tipo de retorno para Task

# VSTHRD105_MessageFormat
source: Avoid method overloads that assume TaskScheduler.Current. Use an overload that accepts a TaskScheduler and specify TaskScheduler.Default (or any other) explicitly.
pt_br: Evite sobrecargas de método que assumem TaskScheduler.Current. Use uma sobrecarga que aceita um TaskScheduler e especifique TaskScheduler.Default (ou qualquer outro) explicitamente.

# VSTHRD105_Title
source: Avoid method overloads that assume TaskScheduler.Current
pt_br: Evite sobrecargas de método que assumem TaskScheduler.Current

# VSTHRD012_MessageFormat
source: Provide an instance of JoinableTaskFactory in this call (or another overload) to avoid deadlocks with the main thread.
pt_br: Forneça uma instância de JoinableTaskFactory nessa chamada (ou outra sobrecarga) para evitar deadlocks com o thread principal.

# VSTHRD012_Title
source: Provide JoinableTaskFactory where allowed
pt_br: Fornecer o JoinableTaskFactory quando permitido

# VSTHRD104_MessageFormat
source: Expose an async version of this method that does not synchronously block. Then simplify this method to call that async method within a JoinableTaskFactory.Run delegate.
pt_br: Exporte uma versão assíncrona desse método que não bloqueia de forma síncrona. Em seguida, simplifique esse método para chamar esse método assíncrono em um delegado JoinableTaskFactory.Run.

# VSTHRD104_Title
source: Offer async methods
pt_br: Oferecer métodos assíncronos

# VSTHRD001_MessageFormat
source: Await JoinableTaskFactory.SwitchToMainThreadAsync() to switch to the UI thread instead of APIs that can deadlock or require specifying a priority.
pt_br: Espere que o JoinableTaskFactory.SwitchToMainThreadAsync() mude o thread da interface do usuário em vez das APIs que podem realizar deadlock ou requerer a especificação de uma prioridade.

# VSTHRD001_Title
source: Avoid legacy thread switching APIs
pt_br: Evitar APIs de troca de treads herdadas

# VSTHRD107_MessageFormat
source: Missing await operator for "using" expression.
pt_br: Operador await ausente para a expressão “using”

# VSTHRD107_Title
source: Await Task within using expression
pt_br: Await Task em uma expressão using

# VSTHRD107_CodeFix_Title
source: Await using expression
pt_br: Expressão await using

# VSTHRD002_CodeFix_Await_Title
source: Use await instead
pt_br: Em vez disso, use a espera

# VSTHRD108_MessageFormat
source: Thread affinity checks should be unconditional.
pt_br: As verificações de afinidade de thread devem ser incondicionais.

# VSTHRD108_Title
source: Assert thread affinity unconditionally
pt_br: Declarar a afinidade de thread de forma incondicional

# VSTHRD109_MessageFormat
source: Avoid throwing when not on the main thread while in an async or Task-returning method. Switch to the thread required instead.
pt_br: Evite lançar quando não estiver no thread principal enquanto estiver em um método assíncrono ou de Retorno de tarefa. Mude para o thread necessário em vez disso.

# VSTHRD109_Title
source: Switch instead of assert in async methods
pt_br: Mude em vez de declarar em métodos assíncronos

# VSTHRD010_MessageFormat_Sync
source: Accessing "{0}" should only be done on the main thread. Call {1}() first.
pt_br: O acesso a "{0}" deve ser realizado somente no thread principal. Chame {1}() primeiro.

# VSTHRD010_MessageFormat_Async
source: Accessing "{0}" should only be done on the main thread. Await JoinableTaskFactory.SwitchToMainThreadAsync() first.
pt_br: O acesso a "{0}" deve ser realizado somente no thread principal. Aguarde JoinableTaskFactory.SwitchToMainThreadAsync() primeiro.

# VSTHRD004_MessageFormat
source: Calls to JoinableTaskFactory.SwitchToMainThreadAsync() must be awaited.
pt_br: Chamadas a JoinableTaskFactory.SwitchToMainThreadAsync() devem ser aguardadas.

# VSTHRD004_Title
source: Await SwitchToMainThreadAsync
pt_br: Aguarde SwitchToMainThreadAsync

# VSTHRD110_MessageFormat
source: Observe the awaitable result of this method call by awaiting it, assigning to a variable, or passing it to another method.
pt_br: Observe o resultado esperável dessa chamada de método aguardando-o, atribuindo-o a uma variável ou passando-o a outro método.

# VSTHRD110_Title
source: Observe result of async calls
pt_br: Observe o resultado das chamadas assíncronas

# VSTHRD011b_MessageFormat
source: Invoking or blocking on async code in a Lazy<T> value factory can deadlock. Use AsyncLazy<T> instead.
pt_br: A invocação ou bloqueio em código assíncrono em um alocador de valor Lazy<it id="1" pos="open"><T></it> pode causar um deadlock. Use AsyncLazy<it id="2" pos="open"><T></it> em vez disso.

# VSTHRD200_AddAsync_MessageFormat
source: Use "Async" suffix in names of methods that return an awaitable type.
pt_br: Use o sufixo "Async" em nomes de métodos que retornam um tipo esperável.

# VSTHRD200_RemoveAsync_MessageFormat
source: Avoid "Async" suffix in names of methods that do not return an awaitable type.
pt_br: Evite o sufixo "Async" em nomes de métodos que não retornam um tipo esperável.

# VSTHRD111_CodeFix_False_Title
source: Add .ConfigureAwait(false)
pt_br: Adicione .ConfigureAwait(false)

# VSTHRD111_CodeFix_True_Title
source: Add .ConfigureAwait(true)
pt_br: Adicione .ConfigureAwait(true)

# VSTHRD111_MessageFormat
source: Add .ConfigureAwait(bool) to your await expression.
pt_br: Adicione .ConfigureAwait(bool) a sua expressão await.
